init.org
#+title: Initialization of the Emacs Text Editor
#+author: Hunter Jozwiak
#+startup: fold
#+property: header-args:emacs-lisp :tangle yes :mkdirp yes :exports code

* Rationalle
I was configuring Emacs in a more modular fashion, but I find it a bit unwieldy considering I have a good many of them now and I would like to consolidate things into one file so I can more easily parooze the init file should something break further on down the line.
That, and I think it is interesting to learn more about org-mode and all the features that it offers, especially with regards to its babel blocks.
* Starting Out
I rely on a few things to make my config work properly.
- use-package to fetch and install packages.
- MELPA/ELPA for the main bulk of packages; I did use straight for a while but I don't think it is strictly necessary so package will do fine.
- Some sort of spoken output. For now, I am relying on Emacspeak to provide this, but might switch to speechd-el.
** Set Up Some Encoding Systems
My particular machine is uses UTF-8, so we need to inform Emacs of this.
#+begin_src emacs-lisp
  ;;; init.el --- My configuration for Emacs.        -*- lexical-binding: t; -*-

  ;; Copyright (C) 2022  Hunter Jozwiak

  ;; Author: Hunter Jozwiak <hunter.t.joz@gmail.com>
  ;; Keywords: config

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; Do not edit this file directly; it is tangled from init.org
  ;;; Code:


  (set-default-coding-systems 'utf-8)
#+end_src
** Segregate the Custom Settings
I prefer to have customizations handled by use-package, so we'll split the things that Emacs really needs to operate out into a custom file instead.
I don't know why I actually do this; it is probably a holdover from back in the day when I rolled n Emacs config in colledge that made heavy use of the custom interface.
But for now, the custom interface serves more as a source of knowledge along with code spelunking and the helpful interface.
#+begin_src emacs-lisp
  (customize-set-variable 'custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
  (load custom-file))
#+end_src
** Load in Some Package Archives
I get packages primariy from [[https:melpa.org][MELPA]] and [[https:elpa.gnu.org][GNU ELPA]].
#+begin_src emacs-lisp
  (customize-set-variable 'package-archives
                            '(("melpa" . "https://melpa.org/packages/")
                              ("gnu" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
#+end_src
**  Get use-package
As mentioned previously, I make heavy use of use-package henceforth to do actual loading and configuration work.
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)
#+end_src
** no-littering
This package keeps your config directory clean of cruft that will accumulate over time.
#+begin_src emacs-lisp
  (use-package no-littering :ensure t)
#+end_src
** general.el
This is a handy utility for creating keybindings, as well as a few other things that I don't really make much youse of.
#+begin_src emacs-lisp
  (use-package general
    :ensure t
    :config
    (general-evil-setup)
    (general-create-definer mapleader
      :prefix "SPC"
      :global-prefix "C-SPC"
      :keymaps 'override
      :states '(normal visual emacs insert))
      (mapleader
    "b" '(:ignore t :which-key "Buffer management")
    "bb" '(switch-to-buffer :which-key "Buffer management")
    "bn" '(next-buffer :which-key "Next buffer")
    "bd" '(evil-delete-buffer :which-key "Kill a buffer")
    "bp" '(previous-buffer :which-key "Previous buffer")
    "br" '(revert-buffer :which-key "Revert the current buffer")
    "f" '(:ignore t :which-key "Files")
    "ff" '(find-file :which-key "Find a file on disk")
    "fs" '(save-buffer :which-key "Save changes")
    "F" '(:ignore t :which-key "Frames")
    "Fo" '(other-frame :which-key "Other frame")
    "g" '(:ignore t :which-key "Git operations")
    "h" '(:ignore t :which-key "Get help")
    "hd" '(:ignore t :which-key "Describe parts of Emacs")
    "hdb" '(describe-bindings :which-key "Describe the bindings that are in effect")
    "hdB" '(general-describe-keybindings :which-key "Show the bindings that General has defined.")
    "hdf" '(describe-function :which-key "Describe a function")
    "hdF" '(describe-face :which-key "Describe a face")
    "hdk" '(describe-key :which-key "Show the documentation for the function associated with key")
    "hdv" '(describe-variable :which-key "Show the docs for a variable")
    "hi" '(:ignore t :which-key "info things")
    "hii" '(info :which-key "Enter the info index")
    "q" '(:ignore t :which-key "Closing Emacs itself or frames within.")
    "qQ" '(kill-emacs :which key "Leave Emacs.")))
#+end_src
** Executing System Commands
exec-path-from shell is quite handy for building a path for us to use in Emacs, so we should take advantage of this.
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :ensure t
    :config
    (exec-path-from-shell-initialize))
#+end_src
** Prepare the Load Path
So that use-package knows where emacspeak is, we had better tell it beforehand.
#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name "emacspeak/lisp/" user-emacs-directory))
#+end_src
* Emacs Builtins
Admittedly, this section is a bit nebulous and should probably be refactored as a later date.
** User Identification and Some Early Config
I'm not exactly sure of the best way to do this, but I recall from a config elsewhere that did a use-package emacs to customize things like this.
#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (auto-save-name-transforms `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
    (inhibit-startup-message t)
     (indent-tabs-mode nil)
     (tool-bar-mode nil)
     (menu-bar-mode nil)
     (scroll-bar-mode nil)
     (user-full-name "Hunter Jozwiak")
     (user-mail-address "hunter.t.joz@gmail.com")
     (user-login-name "sektor")
     (use-short-answers t))
#+end_src
** auto-revert
For changing buffers when the underlying file on disk is changed.
#+begin_src emacs-lisp
  (use-package autorevert
    :custom
    (auto-revert-interval 0.1)
  :config
      (global-auto-revert-mode))
#+end_src
** recentf
For keeping track of files that you have recently visited.
#+begin_src emacs-lisp
  (use-package recentf
    :config (recentf-mode))
#+end_src
** savehist
Logs your command history.
#+begin_src emacs-lisp
  (use-package savehist
    :config (savehist-mode))
#+end_src
** windmove and Winner
These two packages allow for easily getting around windows in Emacs. windmove provides movement commands, and winner allows for the undo and redo of window configurations.
#+begin_src emacs-lisp
  (use-package windmove
    :general
    (mapleader
      "w" '(:ignore t :which-key "Window operations")
      "wh" '(windmove-left :which-key "Select the window to the left")
      "wl" '(windmove-right :which-key "Select the window to the right")
      "wj" '(windmove-down :which-key "Select the window below")
      "wk" '(windmove-up :which-key "Select window above")))
    (use-package winner
      :general
      (mapleader
        "wr" '(winner-redo :which-key "Restore a window configuration")
        "wu" '(winner-redo :which-key "Restore a window configuration"))
      :config
      (winner-mode))
#+end_src
** auth-sources
I rely heavily on pass for doing management of my main logins; the only reason I have an authinfo file is for forge, though I suspect given a bit of code spelunking and some inginuity I could change this.
#+begin_src emacs-lisp
  (use-package auth-source
    :custom
    (auth-source-cache-expiry nil))
  (use-package auth-source-pass
    :custom
    (auth-sources '("~/.authinfo.gpg" password-store))
    :config
    (auth-source-pass-enable))
#+end_src
** GPG
This used to be its own module, but since it stood alone it might as well be collapsed into here.
#+begin_src emacs-lisp
  (use-package epa
    :custom
    (epa-pinentry-mode 'loopback))
#+end_src
* Emacspeak
For now, I make use of the Emacspeak package to provide spoken and auditory feedback for Emacs. It resides as a submodule of this git repository, so loading it is pretty trivial with use-package.
#+begin_src emacs-lisp
  (use-package emacspeak-setup
    :custom
    (espeak-default-speech-rate 820)
     (emacspeak-character-echo nil)
     (emacspeak-word-echo nil))
#+end_src
*Completion
** Orderless
#+begin_quote
Completion style for matching regexps in any order --From the brief package summary
#+end_quote
Again, another package that I have not yet begun to configure entirely, so a good source for things is the [[info:orderless][manual]] and the [[https:github.com/oantolin/orderless][main repository.]]
#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :custom
    (completion-category-overrides '((file (styles . (basic partial-completion)))))
    (completion-styles '(orderless basic)))
#+end_src
** Vertico
A nice package for completing things like file names, commands, and so much more. This config probably doesn't scratch the surface of all the things that Vertico can do, so I will refer you to the [[https:github.com/minad/vertico][main Vertico repository.]] Another good source of information is the [[info:vertico][manual.]]
#+begin_src emacs-lisp
  (use-package vertico
    :custom (vertico-count 20)
             (vertico-cycle t)
    :ensure t
    :general
     (vertico-map
     "C-J" 'vertico-next
     "C-k" 'vertico-previous)
     :init
     (vertico-mode 1))
  (use-package vertico-directory
               :after vertico
      :general
       (vertico-map
       "C-l" 'vertico-directory-enter
       "C-h" 'vertico-directory-up))
#+end_src
** Marginalia
For providing annotations for completions in the minibuffer.
#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :config (marginalia-mode))
#+end_src
