init.org
** Embark, Consult  and embark-consult
#+begin_src emacs-lisp
  (use-package consult
    :ensure t
    :demand t
    :custom
    (completion-in-region-function #'consult-completion-in-region)
    :general
     ([remap switch-to-buffer] 'consult-buffer))

  (use-package embark
    :ensure t
    :demand t
    :general
     ([remap describe-bindings] 'embark-bindings
     "C-." 'embark-act))

  (use-package embark-consult
               :ensure t
               :after (embark consult)
      :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src
** Corfu
A replacement for company, from what I can tell thus far. There are a few kinks that need to be ironed out.
- When completing code, emacspeak only reads the documentation.
- When typing in normal buffers, Emacspeak plays the progress chime which gets real annoying real fast.
I suspect things will need to be hooked into and/or advised, so I will need to delve deeper into that.
#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :custom
    (corfu-cycle t)
     (corfu-auto t)
     (corfu-auto-prefix 2)
     (corfu-auto-delay 0.0)
     (corfu-echo-documentation 0.25)
     :init
     (global-corfu-mode 1))
  (use-package corfu-doc
    :ensure t
    :hook (corfu-mode . corfu-doc-mode))
#+end_src
** Completion at Point Functions
For enhancing the things that completion at point can do. There are a few things here that I don't fully understand.
- Functions are advised here to supress warnings, which helps out Corfu.
- I wonder if these advices will interfeer in some way with Emacspeak, though I doubt this since the end result with Corfu completions is the same.
#+begin_src emacs-lisp
  (use-package cape
    :ensure t
    :demand t
    :config
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify)
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file))
#+end_src
* Communication
Some external communication packages for talking with people across services such as IRC, Twitter, and the fedaverse.
** IRC
I've come to enjoy circe as an IRC client.
- It's easier to configure than erc.
- It supports SASL out of the box.
- Unfortunately, it doesn't automatically connect to the networks I define in circe-network-options like rcirc, but that is something I plan to address soon.
#+begin_src emacs-lisp
  (use-package circe
    :ensure t
    :custom
    (circe-network-options `(
                                                     ("Libera"
                                                      :sasl-username "sektor"
                                                      :sasl-password ,(auth-source-pass-get 'secret "irc/libera.chat:6697/sektor")
                                                      :host "irc.libera.chat"
                                                      :port 6697
                                                      :use-tls t
                                                      :channels ("#archlinux" "#systemcrafters" "#sbcl" "#guix" "#emacs" "#pleroma" "#pleroma-dev"))
                                                     ("Zeronode"
                                                      :host "irc.zeronode.net"
                                                      :port 6697
                                                      :use-tls t
                                                      :sasl-username "sektor"
                                                      :sasl-password ,(auth-source-pass-get 'secret "irc/zeronode.net:6697/sektor")
                                                      :channels ("#noagenda"))
                                                     ("Stormmux"
                                                       :host "irc.stormux.org"
                                                       :port 6697
                                                       :use-tls t
                                                       :sasl-username "sektor"
                                                       :sasl-password ,(auth-source-pass-get 'secret "irc/stormux.org:6697/sektor")
                                                       :channels ("#a11y"))))
    (circe-default-nick user-login-name)
     (circe-auto-join-default-type 'after-auth))
#+end_src
** Mastodon
For communicating across the fedaverse.
#+begin_src emacs-lisp
  (use-package mastodon
    :ensure t)
#+end_src
** twittering
Communication with Twitter.
#+begin_src emacs-lisp
  (use-package twittering-mode
    :ensure t
    :custom (twittering-oauth-invoke-browser t)
             (twittering-allow-insecure-server-cert t))
#+end_src
* Evil
** undo-tree
#+begin_quote
Emacs has a powerful undo system. Unlike the standard undo/redo system in
most software, it allows you to recover *any* past state of a buffer
(whereas the standard undo/redo system can lose past states as soon as you
redo). However, this power comes at a price: many people find Emacs' undo
system confusing and difficult to use, spawning a number of packages that
replace it with the less powerful but more intuitive undo/redo system.
Both the loss of data with standard undo/redo, and the confusion of Emacs'
undo, stem from trying to treat undo history as a linear sequence of
changes. It's not. The `undo-tree-mode' provided by this package replaces
Emacs' undo system with a system that treats undo history as what it is: a
branching tree of changes. This simple idea allows the more intuitive
behaviour of the standard undo/redo system to be combined with the power of
never losing any history. An added side bonus is that undo history can in
some cases be stored more efficiently, allowing more changes to accumulate
before Emacs starts discarding history.
The only downside to this more advanced yet simpler undo system is that it
was inspired by Vim. But, after all, most successful religions steal the
best ideas from their competitors! --Toby Cubitt
#+end_quote
#+begin_src emacs-lisp

  (use-package undo-tree
    :ensure t
    :init
    (global-undo-tree-mode 1))
#+end_src
** evil-mode
Bring the power of vim-like bindings to Emacs.
#+begin_src emacs-lisp
  (use-package evil
               :ensure t
               :custom
               (evil-want-integration t)
               (evil-want-C-i-jump nil)
               (evil-want-keybind nil)
               (evil-undo-system 'undo-tree)
               :init
               (evil-mode 1))
#+end_src
** evil-collection
For the mass evilification of Emacs modes.
#+begin_src emacs-lisp
  (use-package evil-collection
    :ensure t
               :after evil
               :config
               (evil-collection-init))
#+end_src
* org-mode
The note-taking, coffee brewing, all around awesome son of a gun.
** Base Mode
#+begin_src emacs-lisp
  (use-package org
    :preface
    (defun org-setup ()
      "Hook functions for when we enter an org buffer, not provided by any other major mode."
      (prettify-symbols-mode 1)
      (variable-pitch-mode 1))
    :hook (org-mode . org-setup))
#+end_src
** org-appear
For toggling org elements.
#+begin_src emacs-lisp
  (use-package org-appear
    :ensure t
    :after org
    :hook (org-mode . org-appear-mode))
#+end_src
** evil-org
For enhancing the evil bindings when editing org buffers.
#+begin_src emacs-lisp
  (use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . evil-org-mode)
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
#+end_src
* Programming
Various things for programming activities.
** LSP Support Through Eglot
To the best of my knowledge, there are two packages that provide LSP support: LSP and Eglot. I've had experience with the former, so it's high time to try the latter.
#+begin_src emacs-lisp
  (use-package eglot
    :commands eglot-ensure
    :ensure t
    :custom
    (eglot-autoshutdown t))
#+end_src
** Syntax Checking With Flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :init
    (global-flycheck-mode 1))
#+end_src
** Automatically Balancing with Smartparens
#+begin_src emacs-lisp
  (use-package smartparens
    :ensure t
    :init
    (smartparens-strict-mode 1))
#+end_src
* Projects
** project.el
The inbuilt project management system for Emacs. For the things I do, this works really well for me so I don't know that projectile is as necessary.
#+begin_src emacs-lisp
  (use-package project
    :general
    (mapleader
      "SPC" '(consult-project-buffer :which-key "Switch to a buffer in a project")
      "p" '(:ignore t :which-key "Project operations.")
      "pa" '(project-remember-project :which-key "Add a project to the list")
      "pf" '(project-find-file :which-key "Search for a file within a project")
      "pp" '(project-switch-project :which-key "Switch to a project")
      "ps" '(magit-project-status :which-key "Git status of a project")
      :init
      (unless (file-exists-p project-list-file)
        (project-remember-projects-under "~/projects")
        (project-remember-project "~/.emacs.d/"))))
#+end_src
** Version Control
*** magit
#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :custom
    (magit-delete-by-moving-to-trash nil)
    :commands magit-add-section-hook magit-status magit-stage-file
    :general
    (mapleader
      "gg" '(magit-status :which-key "Magit status")
      "gs" '(magit-stage-file :which-key "Stage the current working file."))
    :config
    (magit-add-section-hook 'magit-status-sections-hook 'magit-insert-modules 'magit-insert-stashes 'append))
#+end_src
**** Extensions
***** Forge
#+begin_src emacs-lisp
  (use-package forge
               :ensure t
               :after magit
               :general
               (mapleader
                 "gf" '(forge-dispatch :which-key "Forge dispatching map.")))
#+end_src
***** magit-gitflow
#+begin_src emacs-lisp
  (use-package magit-gitflow
      :ensure t
      :hook (magit-mode . turn-on-magit-gitflow))
#+end_src
***** Git Time Machine
#+begin_src emacs-lisp
  (use-package git-timemachine
      :ensure t
      :general
      (mapleader
        "gt" '(git-timemachine-toggle :which-key "Toggle the time machine")))
#+end_src
* Dev-opsy Things
For the wonderful world of infrastructure as code.
There are a few things that I use.
- For container orchestration, I tend to go for Kubernetes.
- It's a tossup between Nix and Guix as to which one I will go with going forward, so may the best one win!
** Nix
There is a wonderful package for editing nix files with Emacs, so let's take advantage of it.
#+begin_src emacs-lisp
  (use-package nix-mode
    :ensure t
    :mode "\\.nix\\'")
#+end_src
