init.el

(use-package consult
  :ensure t
  :demand t
  :custom
  (completion-in-region-function #'consult-completion-in-region)
  :general
   ([remap switch-to-buffer] 'consult-buffer))

(use-package embark
  :ensure t
  :demand t
  :general
   ([remap describe-bindings] 'embark-bindings
   "C-." 'embark-act))

(use-package embark-consult
             :ensure t
             :after (embark consult)
    :hook (embark-collect-mode . consult-preview-at-point-mode))

(use-package corfu
  :ensure t
  :custom
  (corfu-cycle t)
   (corfu-auto t)
   (corfu-auto-prefix 2)
   (corfu-auto-delay 0.0)
   (corfu-echo-documentation 0.25)
   :init
   (global-corfu-mode 1))
(use-package corfu-doc
  :ensure t
  :hook (corfu-mode . corfu-doc-mode))

(use-package cape
  :ensure t
  :demand t
  :config
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)
  (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file))

(use-package circe
  :ensure t
  :custom
  (circe-network-options `(
                                                   ("Libera"
                                                    :sasl-username "sektor"
                                                    :sasl-password ,(auth-source-pass-get 'secret "irc/libera.chat:6697/sektor")
                                                    :host "irc.libera.chat"
                                                    :port 6697
                                                    :use-tls t
                                                    :channels ("#archlinux" "#systemcrafters" "#sbcl" "#guix" "#emacs" "#pleroma" "#pleroma-dev"))
                                                   ("Zeronode"
                                                    :host "irc.zeronode.net"
                                                    :port 6697
                                                    :use-tls t
                                                    :sasl-username "sektor"
                                                    :sasl-password ,(auth-source-pass-get 'secret "irc/zeronode.net:6697/sektor")
                                                    :channels ("#noagenda"))
                                                   ("Stormmux"
                                                     :host "irc.stormux.org"
                                                     :port 6697
                                                     :use-tls t
                                                     :sasl-username "sektor"
                                                     :sasl-password ,(auth-source-pass-get 'secret "irc/stormux.org:6697/sektor")
                                                     :channels ("#a11y"))))
  (circe-default-nick user-login-name)
   (circe-auto-join-default-type 'after-auth))

(use-package mastodon
  :ensure t)

(use-package twittering-mode
  :ensure t
  :custom (twittering-oauth-invoke-browser t)
           (twittering-allow-insecure-server-cert t))

(use-package undo-tree
  :ensure t
  :init
  (global-undo-tree-mode 1))

(use-package evil
             :ensure t
             :custom
             (evil-want-integration t)
             (evil-want-C-i-jump nil)
             (evil-want-keybind nil)
             (evil-undo-system 'undo-tree)
             :init
             (evil-mode 1))

(use-package evil-collection
  :ensure t
             :after evil
             :config
             (evil-collection-init))

(use-package org
  :preface
  (defun org-setup ()
    "Hook functions for when we enter an org buffer, not provided by any other major mode."
    (prettify-symbols-mode 1)
    (variable-pitch-mode 1))
  :hook (org-mode . org-setup))

(use-package org-appear
  :ensure t
  :after org
  :hook (org-mode . org-appear-mode))

(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package eglot
  :commands eglot-ensure
  :ensure t
  :custom
  (eglot-autoshutdown t))

(use-package flycheck
  :ensure t
  :init
  (global-flycheck-mode 1))

(use-package smartparens
  :ensure t
  :init
  (smartparens-strict-mode 1))

(use-package magit
  :ensure t
  :custom
  (magit-delete-by-moving-to-trash nil)
  :commands magit-add-section-hook magit-status magit-stage-file
  :general
  (mapleader
    "gg" '(magit-status :which-key "Magit status")
    "gs" '(magit-stage-file :which-key "Stage the current working file."))
  :config
  (magit-add-section-hook 'magit-status-sections-hook 'magit-insert-modules 'magit-insert-stashes 'append))

(use-package forge
             :ensure t
             :after magit
             :general
             (mapleader
               "gf" '(forge-dispatch :which-key "Forge dispatching map.")))

(use-package magit-gitflow
    :ensure t
    :hook (magit-mode . turn-on-magit-gitflow))

(use-package git-timemachine
    :ensure t
    :general
    (mapleader
      "gt" '(git-timemachine-toggle :which-key "Toggle the time machine")))

(use-package nix-mode
  :ensure t
  :mode "\\.nix\\'")
