init.org
** Kubernetes
The behemoth of a container engine, but addmitedly interesting nonetheless.
#+begin_src emacs-lisp
  (use-package kubernetes
    :ensure t
    :general
    (mapleader
      "k" '(:ignore t :which-key "Kubernetes operations")
      "ko" '(kubernetes-overview :which-key "Get an overview")))
#+end_src
* Better Help With Helpful
#+begin_src emacs-lisp
  (use-package helpful
    :ensure t
    :general
     ([remap describe-function] 'helpful-callable
     [remap describe-key] 'helpful-key
     [remap describe-variable] 'helpful-variable))
#+end_src
* Which Key
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (which-key-mode 1))
#+end_src
* Restarting Emacs
#+begin_src emacs-lisp
  (use-package restart-emacs
    :ensure t
    :general
    (mapleader
     "qr" '(restart-emacs :which-key "Restart Emacs")))
#+end_src
* Coda
#+begin_src emacs-lisp
  ;;; init.el ends here
#+end_src
