init.el

(use-package helpful
  :ensure t
  :general
   ([remap describe-function] 'helpful-callable
   [remap describe-key] 'helpful-key
   [remap describe-variable] 'helpful-variable))

(use-package which-key
  :ensure t
  :init
  (which-key-mode 1))

(use-package restart-emacs
  :ensure t
  :general
  (mapleader
   "qr" '(restart-emacs :which-key "Restart Emacs")))

;;; init.el ends here
